import { Info } from "./info.types";

export const paragraphs = [
  "저는 대학 입학 후 처음 프로그래밍을 접했고, 코드가 정상적으로 실행될 때의 성취감에 매료되었습니다. 이후 소프트웨어학과를 복수전공하며 알고리즘 문제 해결에 흥미를 느껴 꾸준히 학습한 끝에 solved.ac P5(상위 약 4%) 티어를 달성하였습니다. 또한, 2023 아주대학교 산업수학 프로그래밍 경진대회 2등, 2024 아주대학교 프로그래밍 경진대회(APC) Div.2 대상(1등)을 수상하며 실력을 인정받았습니다.",
  "2024년에는 수학과 소학회 MiC의 회장을 맡아 프로그래밍 멘토링과 코딩 대회를 기획·운영하며 교육 방식과 리더십을 배웠습니다. 특히, 더 나은 학습 환경을 제공하기 위해 직접 코딩 대회 사이트를 개발하며 백엔드(Spring Boot), 프론트엔드(React), 데이터베이스(Supabase)를 활용하며 실무적인 개발 경험을 쌓을 수 있었습니다. 그렇게 저는 개발자의 꿈을 향해 한 걸음 다가갔다고 생각합니다.",
  "다양한 기술에 대한 호기심으로 프론트엔드(React, TypeScript), 백엔드(Spring Boot, Django), 모바일 앱(Flutter), 게임 개발(Unity) 등 폭넓은 경험을 쌓았습니다. 방학마다 독학으로 앱과 웹사이트를 개발하며 문제 해결 능력을 키웠고, 끈기와 논리적 사고력을 기를 수 있었습니다.",
  "저는 새로운 것을 배우는 과정에서 끈기 있게 문제를 해결하는 것이 저만의 강점이라고 생각합니다. 앞으로도 새로운 도전에 적극적으로 나서며, 팀원들과 협력하여 최적의 솔루션을 찾아가는 개발자가 되고 싶습니다.",
];

export const INFO_ROWS: Info[] = [
  { label: "이름", value: "주민찬" },
  { label: "생년월일", value: "2002.02.07" },
  { label: "전화번호", value: "010-8592-7570" },
  { label: "이메일", value: "mcj00220077@gmail.com" },
  { label: "주소", value: "경기도 수원시 영통구" },
];

export const EDU_ROWS: Info[] = [
  { label: "학교", value: "아주대학교" },
  { label: "입학", value: "2020.03" },
  { label: "졸업(예정)", value: "2026.08" },
  { label: "1전공", value: "수학과" },
  { label: "복수전공", value: "소프트웨어학과" },
  { label: "학기", value: "4-2 (이수, 2026.02 기준)" },
];
